network 20.20.22.1 0.0.0.255 area 0
20.20.22.1 0.0.0.255 area 0
gigabitE0/0 20.20.22./24
Serial0/1/0 20.30.20.1/30
Serial0/1/1 20.30.10.1/30


R1(config)# router ospf 100
R1(config-router)# network 20.20.22.0 0.0.0.255 area 0
R1(config-router)# network 20.30.20.0 0.0.0.3 area 0
R1(config-router)# network 20.30.10.0 0.0.0.3 area 0

R1(config)# router ospf 100
R1(config-router)# network 20.20.22.0 0.0.0.255 area 0
R1(config-router)# network 20.30.40.0 0.0.0.3 area 0


Backbone-Router3(config)# interface GigabitEthernet0/0
Backbone-Router3(config-if)# shutdown
Backbone-Router3#show ip ospf interface

clear ip ospf processÂ 




partie 5 
Backbone-Router4(config)# interface GigabitEthernet0/0
Backbone-Router4(config-if)# ip address 20.30.40.1 255.255.255.0
Backbone-Router4(config-if)# no shutdown




Backbone-Switch(config)# interface FastEthernet0/1
Backbone-Switch(config-if)# switchport mode access
Backbone-Switch(config-if)# switchport access vlan 1
Backbone-Switch(config-if)# no shutdown





